In [1]:
%load_ext sql
import sqlite3

In [2]:
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [3]:
%%sql
SELECT locationID, LocationCode
FROM LOCATIONS_DIM
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'BCC 200'),
 (2, 'BD '),
 (3, 'BH '),
 (4, 'BH BY ARR'),
 (5, 'BLM 112'),
 (6, 'BLM LL105'),
 (7, 'BNW 124'),
 (8, 'BNW 127'),
 (9, 'BNW 128'),
 (10, 'BNW 129B')]

In [4]:
%%sql
SELECT *
FROM sqlite_master

 * sqlite:///CourseDataWarehouse.db
Done.

[('table', 'COURSE_MEETINGS', 'COURSE_MEETINGS', 6, 'CREATE TABLE COURSE_MEETINGS(\n    CourseMeetingID INTEGER PRIMARY KEY,\n    CourseOfferingID INTEGER NOT NULL,\n    LocationID INTEGER NOT NULL,\n   ... (74 characters truncated) ... gID TEXT NOT NULL,\n    CourseID INTEGER NOT NULL,\n    ProgramID INTEGER NOT NULL,\n    CourseTitle TEXT NOT NULL,\n    CatalogYear TEXT NOT NULL\n)'),
 ('table', 'CATALOG_COURSES', 'CATALOG_COURSES', 2, 'CREATE TABLE CATALOG_COURSES (\n    CourseID INTEGER PRIMARY KEY,\n    CatalogYear TEXT NOT NULL,\n    CatalogID TEXT NOT NULL,\n    ProgramID INTEGE ... (13 characters truncated) ... eTitle TEXT NOT NULL,\n    Credits TEXT NOT NULL,\n    Prereqs TEXT,\n    Coreqs TEXT,\n    Fees TEXT,\n    Attributes TEXT,\n    Description TEXT\n)'),
 ('table', 'PROGRAMS', 'PROGRAMS', 3, 'CREATE TABLE PROGRAMS (\n    ProgramID INTEGER PRIMARY KEY,\n    ProgramCode TEXT NOT NULL,\n    ProgramName TEXT NOT NULL\n)'),
 ('table', 'LOCATIONS', 'LOCATIONS', 4, 'CREATE TABLE LOCATIONS (\n    LocationID INTEGER PRIMARY KEY,\n    LocationCode TEXT NOT NULL\n)'),
 ('table', 'INSTRUCTORS', 'INSTRUCTORS', 5, 'CREATE TABLE INSTRUCTORS (\n    InstructorID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'CATALOG_COURSES_DIM', 'CATALOG_COURSES_DIM', 8, 'CREATE TABLE CATALOG_COURSES_DIM (\n    CourseID INTEGER PRIMARY KEY,\n    CatalogYear TEXT NOT NULL,\n    CatalogID TEXT NOT NULL,\n    ProgramID IN ... (23 characters truncated) ...  TEXT NOT NULL,\n    Credits TEXT NOT NULL,\n    Prereqs TEXT,\n    Coreqs TEXT,\n    Fees TEXT,\n    Attributes TEXT,\n    Description TEXT\n    \n)'),
 ('table', 'PROGRAMS_DIM', 'PROGRAMS_DIM', 9, 'CREATE TABLE PROGRAMS_DIM (\n    ProgramID INTEGER PRIMARY KEY,\n    ProgramCode TEXT NOT NULL,\n    ProgramName TEXT NOT NULL\n)'),
 ('table', 'LOCATIONS_DIM', 'LOCATIONS_DIM', 10, 'CREATE TABLE LOCATIONS_DIM (\n    LocationID INTEGER PRIMARY KEY,\n    LocationCode TEXT NOT NULL\n)'),
 ('table', 'INSTRUCTORS_DIM', 'INSTRUCTORS_DIM', 11, 'CREATE TABLE INSTRUCTORS_DIM (\n    InstructorID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'COURSE_MEETING_FACTS', 'COURSE_MEETING_FACTS', 7, 'CREATE TABLE COURSE_MEETING_FACTS(\n    CourseMeetingID INTEGER PRIMARY KEY,\n    CourseOfferingID INTEGER NOT NULL,\n    LocationID INTEGER NOT NULL ... (206 characters truncated) ... rimaryInstructorID INTEGER,\n    Term TEXT NOT NULL,\n    CRN INTEGER NOT NULL,\n    Section TEXT NOT NULL,\n    Credits REAL,\n    Timecodes TEXT\n)')]

# Questions

# What Courses Require a Prereq?

In [23]:
%%sql
SELECT DISTINCT COURSE_MEETING_FACTS.COURSETITLE, PREREQS
FROM Course_Meeting_Facts
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
WHERE PREREQS >=1
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Introduction to Management Accounting', 'AC 0011.'),
 ('Intermediate Accounting I', 'AC 0011.'),
 ('Intermediate Accounting II', 'AC 0203.'),
 ('Accounting Information Systems', 'AC 0012.'),
 ('Advanced Accounting', 'AC 0204; junior or senior standing.'),
 ('Cost Management', 'AC 0012, AC 0203, junior or senior standing.'),
 ('Auditing', 'AC 0204; junior or senior standing.'),
 ('Federal Income Taxation I', 'AC 0204; junior or senior standing.'),
 ('Accounting Information for Decision-Making', 'AC 0400.'),
 ('Roots of American Culture', 'One American Studies Gateway course.')]

In [5]:
%%sql
--What classes require prereq
SELECT CATALOGYEAR, COURSETITLE, PREREQS
FROM CATALOG_COURSES
WHERE PREREQS >=1
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[]

# What Courses Does Dr. Scheraga Teach?

In [6]:
%%sql
SELECT COURSE_MEETING_FACTS.COURSETITLE, NAME
FROM Course_Meeting_Facts
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
WHERE NAME like "%Scheraga"
GROUP BY COURSE_MEETING_FACTS.COURSETITLE, NAME

 * sqlite:///CourseDataWarehouse.db
Done.

[('Argument and Advocacy', 'Carl A.  Scheraga'),
 ('Communication Philosophies, Theories, and Research Traditions', 'Carl A.  Scheraga'),
 ('Family Communication', 'Carl A.  Scheraga'),
 ('Human Communication Theories', 'Carl A.  Scheraga'),
 ('Identities, Discourse, and Social Change', 'Carl A.  Scheraga'),
 ('Interpersonal Communication', 'Carl A.  Scheraga'),
 ('Interpersonal Communication Theories', 'Carl A.  Scheraga'),
 ('Interracial Communication', 'Carl A.  Scheraga'),
 ('Mass Media and Society', 'Carl A.  Scheraga'),
 ('Race, Identity, and Representation', 'Carl A.  Scheraga'),
 ('Research Projects in Communication: Capstone', 'Carl A.  Scheraga')]

# What Were the Course Offerings in Fall 2014?

In [18]:
%%sql
SELECT DISTINCT TERM, COURSE_MEETING_FACTS.COURSETITLE, COURSE_MEETING_FACTS.CATALOGID, NAME
FROM Course_Meeting_Facts
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
WHERE TERM = 'Fall2014'
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Aaron K.  Perkus'),
 ('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Aaron Quinn  Weinstein'),
 ('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Aaron R.  Van Dyke'),
 ('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Abdel Illah A.  Douda'),
 ('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Adam E.  Rugg'),
 ('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Adrian H.  van der Kroef'),
 ('Fall2014', 'Introduction to Financial Accounting', 'AC 0011', 'Adrian S.  Rusu-Sprincenatu'),
 ('Fall2014', 'Introduction to Management Accounting', 'AC 0012', 'Ahmed M.  Ebrahim'),
 ('Fall2014', 'Intermediate Accounting I', 'AC 0203', 'Alan   Anderson'),
 ('Fall2014', 'Intermediate Accounting II', 'AC 0204', 'Alan C.  Murchie')]

# How Many Courses Were Offered Over the 2017 Winter Interession?

In [17]:
%%sql
SELECT DISTINCT TERM, COUNT(COURSE_MEETING_FACTS.COURSETITLE)
FROM Course_Meeting_Facts
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
WHERE TERM = 'Winter2017'
;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Winter2017', 91)]

# What Courses Are 4 Credits?

In [34]:
%%sql
SELECT COURSE_MEETING_FACTS.COURSETITLE, COURSE_MEETING_FACTS.CREDITS, COURSE_MEETING_FACTS.CATALOGID
FROM Course_Meeting_Facts
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
GROUP BY COURSE_MEETING_FACTS.COURSETITLE
HAVING COURSE_MEETING_FACTS.CREDITS = 4
LIMIT 10
;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Adult Health II', 4.0, 'NS 0643'),
 ('Advanced Health Assessment', 4.0, 'NS 0604'),
 ('Advanced Nursing Roles for Systems Leadership and Improvement', 4.0, 'NS 0521'),
 ('Advanced Pathophysiology for Anesthesia Practice', 4.0, 'NS 0669'),
 ('Basic Latin', 4.0, 'LA 0111'),
 ('Biomedical Instrumentation', 4.0, 'BEN 0300'),
 ('Calculus I', 4.0, 'MA 0171'),
 ('Calculus I for Chemistry, Engineering, and Physics Majors', 4.0, 'MA 0145'),
 ('Calculus II', 4.0, 'MA 0172'),
 ('Calculus II for Chemistry, Engineering, and Physics Majors', 4.0, 'MA 0146')]

# What Professors Teach More Than One Course?

In [45]:
%%sql
SELECT DISTINCT COUNT(SECTION) AS SECTIONCOUNT, COURSE_MEETING_FACTS.COURSETITLE, COURSE_MEETING_FACTS.CATALOGID, NAME, TERM
FROM Course_Meeting_Facts
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
WHERE TERM = "Spring2015" AND NAME <> "None"
GROUP BY NAME
HAVING COUNT(*)>1
LIMIT 10
;

 * sqlite:///CourseDataWarehouse.db
Done.

[(66, 'Introduction to Management Accounting', 'AC 0012', 'Aaron K.  Perkus', 'Spring2015'),
 (81, 'Introduction to Management Accounting', 'AC 0012', 'Aaron Quinn  Weinstein', 'Spring2015'),
 (81, 'Introduction to Management Accounting', 'AC 0012', 'Aaron R.  Van Dyke', 'Spring2015'),
 (78, 'Introduction to Management Accounting', 'AC 0012', 'Abdel Illah A.  Douda', 'Spring2015'),
 (54, 'Introduction to Management Accounting', 'AC 0012', 'Adam E.  Rugg', 'Spring2015'),
 (13, 'Accounting Information Systems', 'AC 0265', 'Adrian H.  van der Kroef', 'Spring2015'),
 (54, 'Introduction to Management Accounting', 'AC 0012', 'Adrian S.  Rusu-Sprincenatu', 'Spring2015'),
 (66, 'Cost Management', 'AC 0320', 'Ahmed M.  Ebrahim', 'Spring2015'),
 (78, 'Intermediate Accounting II', 'AC 0204', 'Alan   Anderson', 'Spring2015'),
 (26, 'Intermediate Accounting I', 'AC 0203', 'Alan C.  Murchie', 'Spring2015')]